<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"6a0be76ce5c946130c560badc1b156a59155693a5afca10df7c276463c3ba4f6","plan_job_ref":"Job Create terraform plan #31 at https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6909937224","plan_hash":"1409817a2e7e0c25e450dd6527797acf33dde2b6e53053fac024ac28403d81a7","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/7f3556d1515971610cfb2ed247854805889f930f339dea8aec69cd8e0ba767c6.zip" -> "builds/87e3002bacbff2ee723823dea6a40e24ea3ee8afb614afe0910bca54ebdcaeb4.zip"
        id                             = "co-boomi-atom-secret-install-lambda"
      ~ last_modified                  = "2023-11-16T01:18:06.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:18/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "18" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["secrets"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "*******" -> (known after apply)
      ~ qualifier           = "18" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./lambda/rotate_install_token.py",
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./lambda/package/",
                      + null,
                    ],
                ]
              + filename      = "builds/87e3002bacbff2ee723823dea6a40e24ea3ee8afb614afe0910bca54ebdcaeb4.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/87e3002bacbff2ee723823dea6a40e24ea3ee8afb614afe0910bca54ebdcaeb4.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "*******************" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/7f3556d1515971610cfb2ed247854805889f930f339dea8aec69cd8e0ba767c6.zip" -> "builds/87e3002bacbff2ee723823dea6a40e24ea3ee8afb614afe0910bca54ebdcaeb4.zip"
          ~ "timestamp" = "1700097471039719200" -> "1700262073191025000"
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #31](https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6909937224)